-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Окт 30 2022 г., 08:38
-- Версия сервера: 5.7.35-38
-- Версия PHP: 7.4.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `cx57370_modul`
--

-- --------------------------------------------------------

--
-- Структура таблицы `constractor_templates`
--

CREATE TABLE IF NOT EXISTS `constractor_templates` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `template` varchar(200) NOT NULL,
  `size` varchar(200) NOT NULL,
  `price` int(10) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=161 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `constractor_templates`
--

INSERT INTO `constractor_templates` (`id`, `template`, `size`, `price`) VALUES
(114, 'Картина прямоугольная.png', '', 1),
(115, 'Картина квадратная.png', '', 2),
(116, 'Дует.png', '', 3),
(117, 'Дует-2.png', '', 4),
(119, 'хит-1.png', '', 5),
(121, 'хит-2.png', '', 6),
(122, 'хит-3.png', '', 7),
(123, 'Фантазия.png', '', 8),
(124, 'мечта.png', '', 10),
(126, 'NEW.png', '', 11),
(128, 'хит-4.png', '', 12),
(129, 'Фантазия-3.png', '', 13),
(130, 'мечта-2.png', '', 15),
(157, 'ХИТ-5.png', '', 9),
(158, 'шик.png', '', 14);

-- --------------------------------------------------------

--
-- Структура таблицы `constructor_category`
--

CREATE TABLE IF NOT EXISTS `constructor_category` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `category` varchar(200) NOT NULL,
  `interior` varchar(250) NOT NULL DEFAULT 'empty',
  PRIMARY KEY (`id`),
  UNIQUE KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=43 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `constructor_category`
--

INSERT INTO `constructor_category` (`id`, `category`, `interior`) VALUES
(20, 'Абстракция', 'interior-image_3.png'),
(22, 'Африка', 'interior-image_3.png'),
(23, 'Водопады', 'interior-image_6.png'),
(24, 'Вектор Дизайн', 'interior-image_5.png'),
(25, 'Города', 'interior-image_2.png'),
(26, 'Детские', 'interior-image_3.png'),
(27, 'Животный мир', 'interior-image.png'),
(28, 'Искусство', 'interior-image.png'),
(29, 'Природа пейзажи', ''),
(31, 'Пальмы море', ''),
(32, 'Техника', 'interior-image_6.png'),
(33, 'Цветы', ''),
(34, 'Фантазия', ''),
(35, 'Этническое', ''),
(36, 'Для офиса', ''),
(37, 'Для кафе', 'interior-image_3.png'),
(38, 'Для отелей', 'interior-image_5.png'),
(39, 'Мода Fashion', ''),
(41, 'Античность', 'interior-image_4.png'),
(42, 'Фрески ', '');

-- --------------------------------------------------------

--
-- Структура таблицы `constructor_galеry`
--

CREATE TABLE IF NOT EXISTS `constructor_galеry` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `image` varchar(200) NOT NULL,
  `category` varchar(200) NOT NULL,
  `subcategory` varchar(200) NOT NULL,
  `template` varchar(200) NOT NULL,
  `discount` int(10) NOT NULL,
  `image_size` int(8) NOT NULL DEFAULT '0',
  `vertical_position` int(8) NOT NULL DEFAULT '0',
  `horizontal_position` int(8) NOT NULL DEFAULT '0',
  `scale_x` tinyint(1) NOT NULL DEFAULT '0',
  `scale_y` tinyint(1) NOT NULL DEFAULT '0',
  `image_rotate` varchar(16) NOT NULL DEFAULT 'rotate(0deg)',
  `40x70` int(10) NOT NULL,
  `46x80` varchar(200) NOT NULL,
  `51x90` int(10) NOT NULL,
  `57x100` int(10) NOT NULL,
  `63x110` int(10) NOT NULL,
  `68x120` int(10) NOT NULL,
  `74x130` int(10) NOT NULL,
  `80x140` int(10) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id` (`id`),
  UNIQUE KEY `id_2` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=605 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `constructor_galеry`
--

INSERT INTO `constructor_galеry` (`id`, `image`, `category`, `subcategory`, `template`, `discount`, `image_size`, `vertical_position`, `horizontal_position`, `scale_x`, `scale_y`, `image_rotate`, `40x70`, `46x80`, `51x90`, `57x100`, `63x110`, `68x120`, `74x130`, `80x140`) VALUES
(235, '3331954.jpg', 'Абстракция', '', 'хит-1.png', 0, 89, 16, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(268, '18816280.jpg', 'Абстракция', '', 'хит-2.png', 0, 92, -6, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(269, '24679705.jpg', 'Абстракция', '', 'Картина прямоугольная.png', 0, 69, 49, 15, 0, 0, 'rotate(90deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(270, '69796465.jpg', 'Абстракция', '', 'хит-2.png', 0, 89, 50, 50, 1, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(271, '70351393.jpg', 'Абстракция', '', 'NEW.png', 0, 96, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(272, '78017752.jpg', 'Абстракция', '', 'хит-3.png', 0, 94, 23, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(273, '118956997.jpg', 'Абстракция', '', 'мечта.png', 0, 109, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(275, '164725142.jpg', 'Абстракция', '', 'хит-2.png', 0, 96, -48, 92, 0, 1, 'rotate(90deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(276, '324336956.jpg', 'Абстракция', '', 'Картина прямоугольная.png', 0, 96, 15, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(278, '345695915.jpg', 'Абстракция', '', 'хит-3.png', 0, 114, 26, 100, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(279, '388617424.jpg', 'Абстракция', '', 'мечта.png', 0, 93, 100, 34, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(280, '406419256.jpg', 'Абстракция', '', 'хит-1.png', 0, 97, -88, 34, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(282, '428061490.jpg', 'Абстракция', '', 'мечта.png', 0, 96, 9, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(283, '430827484.jpg', 'Абстракция', '', 'хит-3.png', 0, 94, 73, 37, 0, 1, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(284, '431317912.jpg', 'Абстракция', '', 'мечта-2.png', 0, 115, -5, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(285, '776987806.jpg', 'Абстракция', '', 'NEW.png', 0, 105, 29, 49, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(286, '777745594.jpg', 'Абстракция', '', 'хит-3.png', 0, 97, 27, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(287, '35762215.jpg', 'Античность', 'Италия', 'хит-3.png', 0, 95, 20, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(288, '52078207.jpg', 'Античность', 'Эпоха возрождения', 'хит-3.png', 0, 97, 23, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(289, '63719593.jpg', 'Античность', 'Италия', 'шик.png', 0, 114, 26, -8, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(290, '65047894.jpg', 'Античность', 'Греческая', 'хит-3.png', 0, 94, 30, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(291, '113049265.jpg', 'Античность', 'Италия', 'мечта.png', 0, 111, 2, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(292, '194964740.jpg', 'Античность', 'Греческая', 'Картина прямоугольная.png', 0, 92, -37, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(293, '198402005.jpg', 'Античность', 'Эпоха возрождения', 'хит-1.png', 0, 89, 47, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(294, '210835270.jpg', 'Античность', 'Эпоха возрождения', 'ХИТ-5.png', 0, 118, -1, -20, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(295, '267819563.jpg', 'Античность', 'Эпоха возрождения', 'ХИТ-5.png', 0, 92, -3, 55, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(296, '240994594.jpg', 'Античность', 'Греческая', 'хит-1.png', 0, 89, 15, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(297, '334006868.jpg', 'Античность', 'Италия', 'хит-3.png', 0, 93, 21, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(298, '346744298.jpg', 'Античность', 'Италия', 'Фантазия-3.png', 0, 104, -57, 100, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(299, '368394737.jpg', 'Античность', 'Италия', 'Дует-2.png', 0, 108, -1, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(300, '369610913.jpg', 'Античность', 'Эпоха возрождения', 'хит-1.png', 0, 88, 12, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(301, '386096545.jpg', 'Античность', 'Эпоха возрождения', 'хит-3.png', 0, 100, 23, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(302, '376770709.jpg', 'Античность', 'Эпоха возрождения', 'шик.png', 0, 122, 30, 67, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(303, '419066053.jpg', 'Античность', 'Эпоха возрождения', 'Дует.png', 0, 103, -3, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(304, '403008394.jpg', 'Античность', 'Италия', 'хит-3.png', 0, 97, 2, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(305, '380196052.jpg', 'Античность', 'Италия', 'Картина прямоугольная.png', 0, 89, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(306, '20173414.jpg', 'Африка', 'Люди', 'хит-4.png', 0, 109, 12, -23, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(307, '21541441.jpg', 'Африка', 'Люди', 'хит-3.png', 0, 94, 25, 7, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(308, '34757137.jpg', 'Африка', 'Люди', 'Дует.png', 0, 114, 33, -7, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(309, '133113323-[Converted].jpg', 'Африка', 'Люди', 'Дует.png', 0, 120, -1, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(310, '140701849-[Converted].jpg', 'Африка', 'Люди', 'хит-3.png', 0, 99, 100, 100, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(311, '186033050-[Converted].jpg', 'Африка', 'Люди', 'Дует.png', 0, 94, -2, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(312, '217982125.jpg', 'Африка', 'Саванна', 'мечта.png', 0, 112, -16, 83, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(313, '221796445.jpg', 'Африка', 'Мистика', 'хит-3.png', 0, 97, 21, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(314, '221796463.jpg', 'Африка', 'Мистика', 'Фантазия.png', 0, 101, 26, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(315, '222312736.jpg', 'Африка', 'Мистика', 'хит-3.png', 0, 93, 23, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(316, '223058155.jpg', 'Африка', 'Мистика', 'хит-1.png', 0, 97, 15, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(317, '223225957.jpg', 'Африка', 'Саванна', 'хит-1.png', 0, 200, 17, -6, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(318, '223758031.jpg', 'Африка', 'Мистика', 'хит-1.png', 0, 102, 12, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(319, '240127189.jpg', 'Африка', 'Мистика', 'хит-3.png', 0, 95, 25, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(320, '242489599.jpg', 'Африка', 'Мистика', 'хит-3.png', 0, 110, 34, 26, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(321, '243565390.jpg', 'Африка', 'Мистика', 'мечта.png', 0, 122, -1, 24, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(323, '244608976.jpg', 'Африка', 'Саванна', 'хит-3.png', 0, 107, 33, -41, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(324, '250905553.jpg', 'Африка', 'Саванна', 'хит-3.png', 0, 92, 18, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(325, '253322002.jpg', 'Африка', 'Саванна', 'шик.png', 0, 147, 28, 75, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(326, '269210579.jpg', 'Африка', 'Мистика', 'хит-1.png', 0, 99, 16, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(327, '271307636.jpg', 'Африка', 'Саванна', 'хит-1.png', 0, 94, 12, 100, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(328, '394574002.jpg', 'Африка', 'Люди', 'хит-3.png', 0, 92, 29, 34, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(329, '400017166.jpg', 'Африка', 'Мистика', 'хит-3.png', 0, 99, 30, 100, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(330, '685216864.jpg', 'Африка', 'Саванна', 'Фантазия-3.png', 0, 129, 23, 17, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(331, '789770044.jpg', 'Африка', 'Люди', 'хит-3.png', 0, 91, 20, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(332, '1012981852.jpg', 'Африка', 'Люди', 'хит-3.png', 0, 95, 27, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(333, '1032088081.jpg', 'Абстракция', '', 'хит-1.png', 0, 101, 16, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(334, '32798299-1.jpg', 'Вектор Дизайн', '', 'мечта.png', 0, 100, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(335, '32798299-3.jpg', 'Вектор Дизайн', '', 'хит-1.png', 0, 91, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(336, '32798299-5.jpg', 'Вектор Дизайн', '', 'мечта.png', 0, 94, -2, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(337, '32798299-6.jpg', 'Вектор Дизайн', '', 'хит-1.png', 0, 91, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(348, '3581996.jpg', 'Водопады', '', 'хит-1.png', 0, 99, 12, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(349, '19328719.jpg', 'Водопады', '', 'Фантазия.png', 0, 103, 17, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(350, '46132399.jpg', 'Водопады', '', 'хит-2.png', 0, 89, -6, 31, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(351, '47179894.jpg', 'Водопады', '', 'хит-1.png', 0, 96, 13, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(352, '66085867.jpg', 'Водопады', '', 'Картина прямоугольная.png', 0, 99, 9, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(353, '66574060.jpg', 'Водопады', '', 'мечта.png', 0, 123, -2, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(354, '66710347.jpg', 'Водопады', '', 'хит-4.png', 0, 89, -9, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(355, '56926375.jpg', 'Водопады', '', 'хит-2.png', 0, 96, 50, 100, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(356, '69102241.jpg', 'Водопады', '', 'Фантазия.png', 0, 95, 18, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(357, '69788389.jpg', 'Водопады', '', 'Картина прямоугольная.png', 0, 99, 8, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(358, '69815398.jpg', 'Водопады', '', 'хит-1.png', 0, 124, 10, 85, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(359, '91738679.jpg', 'Водопады', '', 'хит-1.png', 0, 94, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(362, '108740546.jpg', 'Водопады', '', 'хит-3.png', 0, 94, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(363, '111725321.jpg', 'Водопады', '', 'хит-3.png', 0, 92, 20, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(364, '111956981.jpg', 'Водопады', '', 'хит-1.png', 0, 92, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(365, '117069922.jpg', 'Водопады', '', 'мечта.png', 0, 117, -6, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(366, '124482961.jpg', 'Водопады', '', 'хит-1.png', 0, 87, 47, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(367, '124739884.jpg', 'Водопады', '', 'хит-3.png', 0, 92, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(368, '125691077.jpg', 'Водопады', '', 'ХИТ-5.png', 0, 96, 12, -70, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(369, '126062147.jpg', 'Водопады', '', 'Фантазия-3.png', 0, 91, 20, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(370, '148735823.jpg', 'Водопады', '', 'хит-1.png', 0, 99, 16, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(371, '167691602.jpg', 'Водопады', '', 'хит-1.png', 0, 94, 15, 33, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(372, '246910567.jpg', 'Водопады', '', 'Картина квадратная.png', 0, 110, -2, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(373, '304294682.jpg', 'Водопады', '', 'хит-1.png', 0, 98, 14, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(374, '745685140.jpg', 'Водопады', '', 'хит-3.png', 0, 92, 20, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(375, '40359175.jpg', 'Города', '', 'хит-1.png', 0, 101, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(376, '63847519.jpg', 'Города', '', 'хит-3.png', 0, 92, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(377, '65733115.jpg', 'Города', '', 'мечта.png', 0, 115, 2, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(378, '94087960.jpg', 'Города', '', 'хит-3.png', 0, 102, 28, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(379, '95531137.jpg', 'Города', '', 'хит-1.png', 0, 89, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(380, '96414368.jpg', 'Города', '', 'Картина прямоугольная.png', 0, 100, 12, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(381, '108163769.jpg', 'Города', '', 'хит-1.png', 0, 89, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(382, '112933216.jpg', 'Абстракция', '', 'хит-3.png', 0, 92, 21, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(383, '113828068.jpg', 'Города', '', 'хит-2.png', 0, 102, 2, 8, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(384, '118469485.jpg', 'Города', '', 'хит-1.png', 0, 92, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(385, '124831474.jpg', 'Города', '', 'мечта.png', 0, 115, 0, 29, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(386, '130103729.jpg', 'Города', '', 'Фантазия-3.png', 0, 97, 26, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(387, '131695790.jpg', 'Города', '', 'хит-2.png', 0, 91, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(389, '160388702.jpg', 'Города', '', 'Картина прямоугольная.png', 0, 98, 15, -10, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(390, '352270127.jpg', 'Абстракция', '', 'хит-3.png', 0, 96, 22, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(391, '679590811.jpg', 'Города', '', 'хит-1.png', 0, 100, 12, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(392, '367710917.jpg', 'Города', '', 'мечта.png', 0, 115, 1, 80, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(393, '78407473.jpg', 'Детские', '', 'хит-1.png', 10, 97, 29, -73, 0, 0, 'rotate(0deg)', 100, 'Фея', 0, 0, 0, 0, 0, 0),
(394, '60207793.jpg', 'Детские', '', 'Картина квадратная.png', 0, 78, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(395, '78223219.jpg', 'Детские', '', 'Картина квадратная.png', 0, 78, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(397, '94149931.jpg', 'Детские', '', 'Картина квадратная.png', 0, 78, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(398, '94612582.jpg', 'Детские', '', 'Дует.png', 0, 93, 100, 56, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(399, '95349472.jpg', 'Детские', '', 'Фантазия.png', 0, 99, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(401, '96691387.jpg', 'Детские', '', 'хит-3.png', 0, 93, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(403, '101138395.jpg', 'Детские', '', 'хит-1.png', 0, 87, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(404, '101826166.jpg', 'Детские', '', 'хит-3.png', 0, 97, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(405, '105136634.jpg', 'Детские', '', 'Картина квадратная.png', 0, 76, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(406, '107147756.jpg', 'Детские', '', 'Картина квадратная.png', 0, 78, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(407, '108064349.jpg', 'Детские', '', 'Дует.png', 0, 99, 4, 96, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(409, '109447391.jpg', 'Детские', '', 'хит-1.png', 0, 91, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(410, '111255833.jpg', 'Детские', '', 'хит-3.png', 0, 109, 28, -16, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(413, '118694428.jpg', 'Детские', '', 'хит-3.png', 0, 92, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(414, '134414300.jpg', 'Детские', '', 'хит-3.png', 0, 95, 100, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(415, '143103664.jpg', 'Детские', '', 'Фантазия-3.png', 0, 91, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(417, '144308650.jpg', 'Детские', '', 'Картина квадратная.png', 30, 82, 76, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(419, '154077320.jpg', 'Детские', '', 'хит-3.png', 0, 103, 23, -65, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(420, '157509383.jpg', 'Детские', '', 'хит-3.png', 0, 98, -27, -93, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(421, '157510232.jpg', 'Детские', '', 'хит-1.png', 0, 95, 6, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(422, '158492213.jpg', 'Детские', '', 'хит-2.png', 0, 97, 0, 80, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(423, '160461272.jpg', 'Детские', '', 'мечта.png', 0, 109, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(424, '160461317.jpg', 'Детские', '', 'хит-3.png', 0, 104, 39, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(425, '169127393.jpg', 'Детские', '', 'Дует.png', 0, 95, -8, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(426, '169127471.jpg', 'Детские', '', 'ХИТ-5.png', 0, 96, -21, 100, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(428, '251422399.jpg', 'Детские', '', 'Картина прямоугольная.png', 0, 87, 22, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(429, '274161272.jpg', 'Детские', '', 'Картина прямоугольная.png', 0, 90, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(430, '305284403.jpg', 'Детские', '', 'Картина прямоугольная.png', 0, 99, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(431, '318319517.jpg', 'Детские', '', 'шик.png', 0, 110, 26, -11, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(432, '406970269.jpg', 'Детские', '', 'хит-1.png', 0, 106, 6, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(433, '531437584.jpg', 'Детские', '', 'Картина прямоугольная.png', 0, 92, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(434, '543147643.jpg', 'Детские', '', 'Картина квадратная.png', 0, 76, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(435, '565582963.jpg', 'Детские', '', 'хит-3.png', 0, 91, 15, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(436, '659620924.jpg', 'Детские', '', 'Картина прямоугольная.png', 0, 88, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(437, '659620939.jpg', 'Детские', '', 'Картина прямоугольная.png', 0, 0, 0, 0, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(438, '722876404.jpg', 'Детские', '', 'Картина квадратная.png', 0, 81, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(439, '722883286.jpg', 'Детские', '', 'Картина квадратная.png', 0, 78, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(442, '53927395-1.jpg', 'Вектор Дизайн', '', 'хит-3.png', 0, 98, 75, -47, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(443, '2005393.jpg', 'Животный мир', 'Остальные', 'ХИТ-5.png', 0, 92, 95, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(444, '3481673.jpg', 'Животный мир', 'Остальные', 'шик.png', 0, 110, 29, 30, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(445, '16455175.jpg', 'Животный мир', 'Тигры', 'хит-1.png', 0, 103, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(446, '20691136.jpg', 'Животный мир', 'Львы', 'Дует.png', 0, 112, -3, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(447, '21975400.jpg', 'Животный мир', 'Лошади', 'хит-4.png', 0, 106, -1, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(448, '40223956.jpg', 'Животный мир', 'Тигры', 'Картина квадратная.png', 0, 84, 31, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(450, '49596736.jpg', 'Животный мир', 'Пернатые', 'Картина прямоугольная.png', 0, 110, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(451, '51399256.jpg', 'Животный мир', 'Остальные', 'Картина прямоугольная.png', 0, 92, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(452, '56301775.jpg', 'Животный мир', 'Пернатые', 'Картина прямоугольная.png', 0, 95, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(453, '56429470.jpg', 'Животный мир', 'Пернатые', 'шик.png', 0, 123, 28, 83, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(454, '59680462.jpg', 'Животный мир', 'Обитатели саванны', 'хит-1.png', 0, 103, -6, -76, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(455, '63988726.jpg', 'Животный мир', 'Тигры', 'Картина квадратная.png', 0, 77, 32, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(456, '75989233.jpg', 'Животный мир', 'Леопарды', 'Картина квадратная.png', 0, 77, -48, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(457, '76778998.jpg', 'Животный мир', 'Тигры', 'NEW.png', 0, 134, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(458, '79775503.jpg', 'Животный мир', 'Пернатые', 'шик.png', 0, 124, 29, 100, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(459, '81501418.jpg', 'Животный мир', 'Остальные', 'хит-3.png', 0, 133, 20, -12, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(460, '84116608.jpg', 'Животный мир', 'Тигры', 'мечта-2.png', 0, 112, -6, -9, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(461, '88144771.jpg', 'Животный мир', 'Остальные', 'хит-1.png', 0, 95, 13, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(462, '90235852.jpg', 'Животный мир', 'Леопарды', 'хит-1.png', 0, 106, 3, -29, 0, 0, 'rotate(360deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(463, '93511534.jpg', 'Животный мир', 'Леопарды', 'хит-3.png', 0, 103, 18, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(464, '93531199.jpg', 'Животный мир', 'Леопарды', 'хит-1.png', 0, 108, 4, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(465, '94799386.jpg', 'Животный мир', 'Тигры', 'хит-3.png', 0, 117, 50, -18, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(466, '97246205.jpg', 'Животный мир', 'Тигры', 'Картина прямоугольная.png', 0, 109, 10, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(467, '99850187.jpg', 'Животный мир', 'Леопарды', 'Картина прямоугольная.png', 0, 104, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(468, '100493404.jpg', 'Животный мир', 'Лошади', 'хит-3.png', 0, 92, 23, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(469, '109397279.jpg', 'Животный мир', 'Леопарды', 'хит-1.png', 0, 94, 13, 100, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(470, '109676912.jpg', 'Животный мир', 'Лошади', 'хит-1.png', 0, 98, 19, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(471, '111340229.jpg', 'Животный мир', 'Лошади', 'хит-1.png', 0, 90, -83, 39, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(472, '114050824.jpg', 'Животный мир', 'Лошади', 'хит-3.png', 0, 119, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(473, '114625321.jpg', 'Животный мир', 'Леопарды', 'Картина квадратная.png', 0, 76, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(474, '114917683.jpg', 'Животный мир', 'Леопарды', 'хит-3.png', 0, 105, 24, -100, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(475, '116104300.jpg', 'Животный мир', 'Лошади', 'хит-1.png', 0, 89, 7, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(476, '345155603.jpg', 'Абстракция', '', 'хит-1.png', 0, 107, -7, -83, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(477, '119852770.jpg', 'Животный мир', 'Леопарды', 'Фантазия.png', 0, 92, -46, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(478, '120325099.jpg', 'Животный мир', 'Леопарды', 'Картина прямоугольная.png', 0, 89, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(479, '123782440.jpg', 'Животный мир', 'Лошади', 'NEW.png', 0, 96, 28, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(480, '124414564.jpg', 'Животный мир', 'Тигры', 'Картина прямоугольная.png', 0, 92, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(481, '124554612.jpg', 'Животный мир', 'Пернатые', 'хит-3.png', 0, 92, 50, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(482, '127867148.jpg', 'Животный мир', 'Львы', 'Картина прямоугольная.png', 0, 90, 16, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(483, '128418203.jpg', 'Животный мир', 'Леопарды', 'хит-1.png', 0, 104, 14, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(484, '130227029.jpg', 'Животный мир', 'Пернатые', 'Картина прямоугольная.png', 0, 90, -100, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(485, '130798772.jpg', 'Животный мир', 'Пернатые', 'Картина квадратная.png', 0, 104, 4, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(486, '131130065.jpg', 'Животный мир', 'Леопарды', 'Картина прямоугольная.png', 0, 86, -17, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(503, '138821705.jpg', 'Животный мир', 'Остальные', 'хит-1.png', 0, 90, 13, 20, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(504, '138872645.jpg', 'Животный мир', 'Обитатели саванны', 'хит-3.png', 0, 114, -5, -33, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(505, '142735549.jpg', 'Животный мир', 'Пернатые', 'Картина квадратная.png', 0, 81, 0, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(506, '149511794.jpg', 'Животный мир', 'Лошади', 'хит-1.png', 0, 112, 15, 2, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(507, '151980110.jpg', 'Животный мир', 'Леопарды', 'Картина прямоугольная.png', 0, 92, -88, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(508, '156843272.jpg', 'Животный мир', 'Леопарды', 'хит-1.png', 0, 111, 11, -62, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(509, '157155530.jpg', 'Животный мир', 'Тигры', 'хит-3.png', 0, 95, 17, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(510, '157156244.jpg', 'Животный мир', 'Тигры', 'ХИТ-5.png', 0, 94, 18, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(511, '157679138.jpg', 'Животный мир', 'Тигры', 'Картина прямоугольная.png', 0, 99, 27, -100, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(512, '157679141.jpg', 'Животный мир', 'Тигры', 'хит-3.png', 0, 97, 27, 50, 0, 0, 'rotate(0deg)', 100, 'тигры', 0, 0, 0, 0, 0, 0),
(513, '162632210.jpg', 'Животный мир', 'Обитатели саванны', 'Картина прямоугольная.png', 0, 88, 23, 58, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(517, '197081660.jpg', 'Животный мир', 'Лошади', 'хит-1.png', 0, 117, -21, -32, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(518, '198578438.jpg', 'Животный мир', 'Тигры', 'Картина квадратная.png', 0, 76, 1, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(519, '199447181.jpg', 'Животный мир', 'Тигры', 'Картина прямоугольная.png', 0, 82, -30, 53, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(520, '199983482.jpg', 'Животный мир', 'Тигры', 'хит-1.png', 0, 96, 50, -41, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(521, '201578996.jpg', 'Животный мир', 'Леопарды', 'хит-3.png', 0, 129, 68, 99, 1, 1, 'rotate(180deg)', 2, 'леопард', 0, 0, 0, 0, 0, 0),
(522, '201579035.jpg', 'Животный мир', 'Леопарды', 'хит-3.png', 0, 106, 2, 70, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(523, '205148152.jpg', 'Животный мир', 'Леопарды', 'ХИТ-5.png', 0, 104, -3, -100, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(526, '207381364.jpg', 'Животный мир', 'Леопарды', 'ХИТ-5.png', 0, 94, 10, 50, 0, 0, 'rotate(0deg)', 100, '0', 0, 0, 0, 0, 0, 0),
(528, '16455175.jpg', 'Животный мир', 'Тигры', 'хит-1.png', 10, 110, 50, 24, 0, 0, 'rotate(0deg)', 1, 'Львы', 0, 0, 0, 0, 0, 0),
(529, '20691136.jpg', 'Животный мир', 'Львы', 'Дует.png', 0, 113, 0, 50, 0, 0, 'rotate(0deg)', 5, '', 0, 0, 0, 0, 0, 0),
(553, '1937178289.jpg', 'Для кафе', '', 'Фантазия.png', 0, 110, 22, 27, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(554, '1398210953.jpg', 'Для кафе', '', 'хит-4.png', 0, 123, -1, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(555, '1220071765.jpg', 'Для кафе', '', 'хит-1.png', 0, 95, 18, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(556, '1333741913.jpg', 'Для отелей', '', 'хит-3.png', 0, 96, 25, -14, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(557, '26675923.jpg', 'Техника', 'Автомобили', 'хит-3.png', 0, 92, 25, 60, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(558, '30476674.jpg', 'Техника', 'Автомобили', 'хит-3.png', 0, 91, 23, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(561, '59555233.jpg', 'Техника', 'Автомобили', 'Картина прямоугольная.png', 0, 91, 12, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(562, '46184395.jpg', 'Техника', 'Автомобили', 'Фантазия.png', 0, 96, -12, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(563, '51832201.jpg', 'Техника', 'Автомобили', 'хит-3.png', 0, 92, 14, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(564, '53672743.jpg', 'Техника', 'Автомобили', 'хит-3.png', 0, 97, 17, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(565, '57034834.jpg', 'Техника', 'Автомобили', 'хит-3.png', 0, 98, -43, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(566, '58467457.jpg', 'Техника', 'Автомобили', 'хит-3.png', 0, 91, 24, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(567, '66645748.jpg', 'Техника', 'Самолеты', 'хит-3.png', 0, 118, -51, 80, 0, 0, 'rotate(0deg)', 0, 'Самолеты', 0, 0, 0, 0, 0, 0),
(569, '91092473.jpg', 'Техника', 'Автомобили', 'шик.png', 0, 105, 24, -42, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(570, '107413523.jpg', 'Техника', 'Автомобили', 'хит-1.png', 0, 88, 14, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(571, '117808957.jpg', 'Техника', 'Автомобили', 'ХИТ-5.png', 0, 94, -100, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(572, '143318665.jpg', 'Техника', 'Самолеты', 'хит-1.png', 0, 91, 13, 50, 0, 0, 'rotate(0deg)', 0, 'Самолеты', 0, 0, 0, 0, 0, 0),
(573, '151172606.jpg', 'Техника', 'Самолеты', 'хит-3.png', 0, 96, 22, 50, 0, 0, 'rotate(0deg)', 0, 'Самолеты', 0, 0, 0, 0, 0, 0),
(574, '451587259.jpg', 'Техника', 'Самолеты', 'хит-1.png', 0, 96, 13, 50, 0, 0, 'rotate(0deg)', 0, 'Самолеты', 0, 0, 0, 0, 0, 0),
(575, '775190461.jpg', 'Для офиса', '', 'хит-3.png', 0, 93, 26, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(576, '14787394.jpg', 'Искусство', 'Люди', 'хит-1.png', 0, 108, 13, -69, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(577, '15890062.jpg', 'Искусство', 'Люди', 'хит-3.png', 0, 93, 10, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(578, '16423069.jpg', 'Искусство', 'Люди', 'хит-1.png', 0, 88, 16, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(579, '16459099.jpg', 'Искусство', 'Люди', 'хит-3.png', 0, 91, 23, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(580, '17318329.jpg', 'Искусство', 'Осень', 'хит-3.png', 0, 91, 26, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(581, '17318332.jpg', 'Искусство', 'Осень', 'хит-1.png', 0, 90, 16, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(582, '23674096.jpg', 'Искусство', 'Фантазия', 'хит-3.png', 0, 126, 71, -15, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(583, '23792239.jpg', 'Искусство', 'Осень', 'ХИТ-5.png', 0, 95, 16, 32, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(584, '23800816.jpg', 'Искусство', 'Зима', 'хит-3.png', 0, 94, 28, 50, 0, 0, 'rotate(0deg)', 1, '', 0, 0, 0, 0, 0, 0),
(585, '23800819.jpg', 'Искусство', 'Пейзажи', 'хит-3.png', 0, 93, 20, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(586, '23800822.jpg', 'Искусство', 'Пейзажи', 'хит-3.png', 0, 95, 24, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(587, '23800828.jpg', 'Искусство', 'Пейзажи', 'хит-3.png', 0, 94, 23, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(588, '23800831.jpg', 'Искусство', 'Осень', 'хит-3.png', 0, 91, 15, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(589, '24172327.jpg', 'Искусство', 'Зима', 'хит-3.png', 0, 95, 24, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(590, '24172330.jpg', 'Искусство', 'Зима', 'хит-1.png', 0, 92, -25, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(591, '28667482.jpg', 'Искусство', 'Люди', 'Картина квадратная.png', 0, 76, 50, 50, 0, 0, 'rotate(360deg)', 0, '', 0, 0, 0, 0, 0, 0),
(592, '37543984.jpg', 'Искусство', 'Море', 'хит-3.png', 0, 91, 12, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(593, '46030816.jpg', 'Искусство', 'Пейзажи', 'хит-3.png', 0, 91, 20, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(594, '66189202.jpg', 'Искусство', 'Средние века', 'ХИТ-5.png', 0, 93, 16, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(595, '66189205.jpg', 'Искусство', 'Средние века', 'Картина прямоугольная.png', 0, 104, 11, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(596, '86933632.jpg', 'Искусство', 'Средние века', 'Картина прямоугольная.png', 0, 96, 15, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(597, '87195130.jpg', 'Искусство', 'Зима', 'хит-3.png', 0, 93, 7, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(598, '126741635.jpg', 'Искусство', 'Люди', 'Картина квадратная.png', 0, 76, 50, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(599, '129236504.jpg', 'Искусство', 'Натюрморт', 'хит-1.png', 0, 90, 87, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(600, '129236510.jpg', 'Искусство', 'Арт', 'хит-3.png', 0, 101, 12, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(601, '136447223.jpg', 'Искусство', 'Арт', 'хит-3.png', 0, 96, 20, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(602, '169983446.jpg', 'Искусство', 'Пейзажи', 'ХИТ-5.png', 0, 95, 9, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(603, '169985060.jpg', 'Искусство', 'Люди', 'хит-3.png', 0, 95, 15, 50, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0),
(604, '184238750.jpg', 'Искусство', 'Осень', 'ХИТ-5.png', 0, 95, 8, 89, 0, 0, 'rotate(0deg)', 0, '', 0, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `constructor_interiors`
--

CREATE TABLE IF NOT EXISTS `constructor_interiors` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `interior` varchar(200) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=27 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `constructor_interiors`
--

INSERT INTO `constructor_interiors` (`id`, `interior`) VALUES
(21, 'вариант-1.jpg'),
(22, 'interior1.jpg'),
(23, 'interior4.jpg'),
(24, 'interior6.jpg'),
(25, 'interior7.jpg'),
(26, 'интерьер2.jpg');

-- --------------------------------------------------------

--
-- Структура таблицы `constructor_mat`
--

CREATE TABLE IF NOT EXISTS `constructor_mat` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `material` varchar(200) NOT NULL,
  `kof` varchar(10) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `constructor_mat`
--

INSERT INTO `constructor_mat` (`id`, `material`, `kof`) VALUES
(14, 'Матовый', ''),
(15, 'Глянцевый', '10');

-- --------------------------------------------------------

--
-- Структура таблицы `constructor_post`
--

CREATE TABLE IF NOT EXISTS `constructor_post` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `image_name` varchar(200) NOT NULL,
  `post_text` text NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `constructor_post`
--

INSERT INTO `constructor_post` (`id`, `image_name`, `post_text`) VALUES
(9, 'пост2.png', 'Текст поста №2'),
(10, 'пост3.png', 'Текст поста №3'),
(12, '', 'Текст поста55');

-- --------------------------------------------------------

--
-- Структура таблицы `constructor_size`
--

CREATE TABLE IF NOT EXISTS `constructor_size` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `size` varchar(200) NOT NULL,
  `kof` varchar(10) NOT NULL,
  `template` varchar(50) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=75 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `constructor_size`
--

INSERT INTO `constructor_size` (`id`, `size`, `kof`, `template`) VALUES
(32, '50 см 50 см', '750', 'Дует.png'),
(35, '60 см 80 см', '1700', 'Хит-1.png'),
(38, '75 см 95 см', '1850', 'Хит-1.png'),
(39, '85 см 110 см', '2100', 'Хит-1.png'),
(40, '75 см 80 см', '1750', 'Хит-2.png'),
(41, '90 см 95 см', '1950', 'Хит-2.png'),
(42, '110 см 105 см', '2150', 'Хит-2.png'),
(43, '90 см 60 см', '1700', 'Хит-3.png'),
(44, '105 см 75 см', '1950', 'Хит-3.png'),
(45, '135 см 90 см', '2200', 'Хит-3.png'),
(46, '60 см 100 см', '1950', 'Фантазия.png'),
(47, '70 см 115 см', '2350', 'Фантазия.png'),
(48, '85 см 145 см', '2750', 'Фантазия.png'),
(49, '140 см 90 см', '2450', 'Фантазия-2.png'),
(50, '160 см 100 см', '2750', 'Фантазия-2.png'),
(51, '100 см 100 см', '950', 'Дует.png'),
(52, '30 см 40 см', '350', 'Картина прямоугольная.png'),
(55, '50 см 70 см', '550', 'Картина прямоугольная.png'),
(56, '50 см 100 см', '750', 'Картина прямоугольная.png'),
(57, '70 см 130 см', '950', 'Картина прямоугольная.png'),
(58, '40 см 40 см', '400', 'Картина квадратная.png'),
(59, '50 см 50 см', '500', 'Картина квадратная.png'),
(60, '70 см 70 см', '700', 'Картина квадратная.png'),
(61, '100 см 100 см', '950', 'Картина квадратная.png'),
(62, '50 см 50 см', '750', 'Дует-2.png'),
(63, '100 см 100 см', '950', 'Дует-2.png'),
(64, '60 см 80 см', '1700', 'хит-1.png'),
(65, '75 см 95 см', '1850', 'хит-1.png'),
(66, '85 см 110 см', '2100', 'хит-1.png'),
(67, '75 см 80 см', '1750', 'хит-2.png'),
(68, '90 см 95 см', '1950', 'хит-2.png'),
(69, '110 см 105 см', '2150', 'хит-2.png'),
(70, '90 см 60 см', '1700', 'хит-3.png'),
(71, '105 см 75 см', '1950', 'хит-3.png'),
(72, '135 см 90 см', '2200', 'хит-3.png'),
(73, '135 см 90 см', '2200', 'мечта.png'),
(74, '170 см 110 см', '2450', 'мечта.png');

-- --------------------------------------------------------

--
-- Структура таблицы `constructor_subcategory`
--

CREATE TABLE IF NOT EXISTS `constructor_subcategory` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `category` varchar(200) NOT NULL,
  `subcategory` varchar(200) NOT NULL,
  `interior` varchar(250) NOT NULL DEFAULT 'empty',
  PRIMARY KEY (`id`),
  UNIQUE KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=46 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `constructor_subcategory`
--

INSERT INTO `constructor_subcategory` (`id`, `category`, `subcategory`, `interior`) VALUES
(5, 'Пейзажи', 'Осенние пейзажи', 'empty'),
(6, 'Пейзажи', 'Летние пейзажи', 'empty'),
(9, 'Пейзажи', 'Весенние пейзажи', 'empty'),
(15, 'Античность', 'Греческая', 'interior-image_3.png'),
(19, 'Бабочки', 'мухи', 'empty'),
(20, 'Бабочки', 'червячки', 'empty'),
(21, 'Африка', 'Люди ', 'interior-image_3.png'),
(22, 'Африка', 'Саванна', 'interior-image_3.png'),
(23, 'Африка', 'Мистика', 'interior-image_3.png'),
(24, 'Античность', 'Эпоха возрождения', 'interior-image_1.png'),
(25, 'Античность', 'Италия', 'interior-image_6.png'),
(26, 'Животный мир', 'Тигры', 'interior-image.png'),
(27, 'Животный мир', 'Львы', 'interior-image.png'),
(28, 'Животный мир', 'Лошади', 'interior-image.png'),
(29, 'Животный мир', 'Леопарды', 'interior-image.png'),
(30, 'Животный мир', 'Обитатели саванны', 'interior-image.png'),
(31, 'Животный мир', 'Пернатые', 'interior-image.png'),
(32, 'Животный мир', 'Остальные', 'interior-image.png'),
(33, 'Техника', 'Автомобили', 'interior-image_4.png'),
(34, 'Техника', 'Самолеты', 'interior-image_1.png'),
(35, 'Искусство', 'Осень', 'interior-image_3.png'),
(36, 'Искусство', 'Зима', 'interior-image_3.png'),
(37, 'Искусство', 'Люди', 'interior-image_3.png'),
(38, 'Искусство', 'Милые существа', 'interior-image_3.png'),
(39, 'Искусство', 'Фантазия', 'interior-image_3.png'),
(40, 'Искусство', 'Пейзажи', 'interior-image_3.png'),
(41, 'Искусство', 'Море', 'interior-image_3.png'),
(42, 'Искусство', 'Средние века', 'interior-image_3.png'),
(43, 'Искусство', 'Натюрморт', 'interior-image_3.png'),
(44, 'Искусство', 'Пастораль', 'interior-image_3.png'),
(45, 'Искусство', 'Арт', 'interior-image_3.png');

-- --------------------------------------------------------

--
-- Структура таблицы `wallpaper_category`
--

CREATE TABLE IF NOT EXISTS `wallpaper_category` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `category` varchar(200) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=36 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `wallpaper_category`
--

INSERT INTO `wallpaper_category` (`id`, `category`) VALUES
(2, '3 D Арт'),
(3, 'Абстракция фантазия'),
(4, 'Античность'),
(5, 'Африка'),
(6, 'Водопады'),
(7, 'Восток Азия'),
(8, 'Города'),
(9, 'Детские'),
(21, 'Животный мир'),
(22, 'Искусство'),
(23, 'Киногерои'),
(24, 'Космос'),
(25, 'Море ландшафты пальмы'),
(27, 'Природа пейзажи'),
(28, 'Религия'),
(29, 'Япония и сакура'),
(30, 'Техника'),
(31, 'Улочки Италия'),
(32, 'Фреска'),
(33, 'Цветы');

-- --------------------------------------------------------

--
-- Структура таблицы `wallpaper_interior`
--

CREATE TABLE IF NOT EXISTS `wallpaper_interior` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `interior` varchar(200) NOT NULL,
  `order_number` int(11) NOT NULL DEFAULT '999',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `wallpaper_interior`
--

INSERT INTO `wallpaper_interior` (`id`, `interior`, `order_number`) VALUES
(5, 'interior-image_3.png', 3),
(6, 'interior-image_4.png', 4),
(7, 'interior-image_5.png', 999),
(9, 'interior-image.png', 10),
(10, 'interior-image_1.png', 1),
(11, 'interior-image_2.png', 2),
(12, 'interior-image_6.png', 999);

-- --------------------------------------------------------

--
-- Структура таблицы `wallpaper_post`
--

CREATE TABLE IF NOT EXISTS `wallpaper_post` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `title` varchar(250) NOT NULL,
  `text` text NOT NULL,
  `image` varchar(250) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `wallpaper_post`
--

INSERT INTO `wallpaper_post` (`id`, `title`, `text`, `image`) VALUES
(7, 'Заголовок поста', 'Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Имеет моей вершину ты ipsum, предложения ее реторический диких взобравшись строчка пор текстами, рыбными!', '13197.jpg'),
(8, 'Заголовок поста', 'Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Имеет моей вершину ты ipsum, предложения ее реторический диких взобравшись строчка пор текстами, рыбными!', '07207.jpg'),
(9, 'Заголовок поста', 'Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Имеет моей вершину ты ipsum, предложения ее реторический диких взобравшись строчка пор текстами, рыбными!', '04544.jpg'),
(10, 'Скидки', 'еще раз скидки', 'PVH-Potolok-3.jpg');

-- --------------------------------------------------------

--
-- Структура таблицы `wallpaper_price`
--

CREATE TABLE IF NOT EXISTS `wallpaper_price` (
  `id` int(8) NOT NULL AUTO_INCREMENT,
  `texture_id` int(8) NOT NULL,
  `size_id` int(8) NOT NULL,
  `price` int(8) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=24 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `wallpaper_price`
--

INSERT INTO `wallpaper_price` (`id`, `texture_id`, `size_id`, `price`) VALUES
(13, 16, 6, 600),
(14, 16, 4, 750),
(16, 16, 7, 800),
(18, 16, 8, 550),
(20, 18, 8, 555),
(21, 17, 8, 333),
(22, 17, 6, 444),
(23, 17, 4, 555);

-- --------------------------------------------------------

--
-- Структура таблицы `wallpaper_roll`
--

CREATE TABLE IF NOT EXISTS `wallpaper_roll` (
  `id` int(8) NOT NULL AUTO_INCREMENT,
  `roll` int(8) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `wallpaper_roll`
--

INSERT INTO `wallpaper_roll` (`id`, `roll`) VALUES
(4, 165),
(6, 137),
(7, 180),
(8, 105),
(9, 260),
(10, 300);

-- --------------------------------------------------------

--
-- Структура таблицы `wallpaper_subcategory`
--

CREATE TABLE IF NOT EXISTS `wallpaper_subcategory` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `category` varchar(200) NOT NULL,
  `subcategory` varchar(200) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=386 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `wallpaper_subcategory`
--

INSERT INTO `wallpaper_subcategory` (`id`, `category`, `subcategory`) VALUES
(172, '3 D Арт', 'Цветы'),
(181, 'Абстракция фантазия', 'Стильные волны'),
(348, '3 D Арт', 'Мрамор'),
(349, '3 D Арт', '3 D'),
(350, 'Абстракция фантазия', 'Завитушки'),
(362, 'Античность', 'Рим'),
(363, 'Античность', 'Афины'),
(364, 'Античность', 'Париж'),
(365, 'Античность', 'Пальмира'),
(366, 'Античность', 'Авторский микс'),
(367, 'Африка', 'Саванна'),
(368, 'Африка', 'Люди'),
(369, 'Африка', 'Флора'),
(370, 'Восток Азия', 'Египет'),
(371, 'Восток Азия', 'Япония'),
(372, 'Восток Азия', 'Сакура'),
(373, 'Детские', 'Фантазия'),
(374, 'Детские', 'Персонажи'),
(375, 'Детские', 'Фентези'),
(376, 'Детские', 'Животные'),
(377, 'Животный мир', 'Тигры'),
(378, 'Животный мир', 'Пантеры'),
(379, 'Животный мир', 'Львы'),
(380, 'Животный мир', 'Лошади'),
(381, 'Животный мир', 'Разное'),
(382, 'Искусство', 'Природа'),
(383, 'Искусство', 'Животные'),
(384, 'Искусство', 'Люди'),
(385, 'Искусство', 'Абстракция');

-- --------------------------------------------------------

--
-- Структура таблицы `wallpaper_texture`
--

CREATE TABLE IF NOT EXISTS `wallpaper_texture` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `texture` varchar(250) NOT NULL,
  `title` varchar(256) NOT NULL,
  `size` varchar(256) NOT NULL,
  `width` varchar(256) NOT NULL,
  `length` varchar(256) NOT NULL,
  `density` varchar(256) NOT NULL,
  `color_rendering` varchar(256) NOT NULL,
  `base` varchar(256) NOT NULL,
  `video` varchar(1024) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=29 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `wallpaper_texture`
--

INSERT INTO `wallpaper_texture` (`id`, `texture`, `title`, `size`, `width`, `length`, `density`, `color_rendering`, `base`, `video`) VALUES
(16, 'antiko.jpg', 'antico', 'antico', 'Ширина', 'antico', 'antico', 'antico', 'antico', 'https://www.youtube.com/embed/rQs5ah7wJEc?start=27'),
(17, 'arctic.jpg', 'arctic', 'Размеры', 'Ширина', 'Длинна', 'Плотность', 'Цветопередача', 'Основа', 'https://www.youtube.com/embed/SsFI40bXROs'),
(18, 'экофреска-2.jpg', 'Эко фреска', '160', '160', '', '300', '70', 'флизелин', ''),
(19, 'экофреска-3.jpg', 'Экофреска 3', '300', '300', '12', '320', '70', 'флизелин', ''),
(20, 'florentino.jpg', 'Флорентино', '', '105', '30', '300', '70', 'флизелин', ''),
(21, 'fresco.jpg', 'Фреско', '', '105', '30', '300', '70', 'флизелин', ''),
(22, 'latte.jpg', 'Латте', '', '105', '30', '300', '70', 'флизелин', ''),
(23, 'lombardi.jpg', 'Ломбарди', '', '105', '30', '300', '70', 'флизелин', ''),
(24, 'modeno.jpg', 'Модено', '', '105', '30', '300', '70', 'флизелин', ''),
(25, 'provance.jpg', 'Прованс', '', '105', '30', '300', '70', 'флизелин', ''),
(26, 'quarzo.jpg', 'Кварц', '', '105', '30', '300', '70', 'флизелин', ''),
(27, 'veneciano.jpg', 'Венециано', '', '105', '30', '300', '70', 'флизелин', ''),
(28, 'экофреска-4.jpg', 'ЭКОФРЕСКА 4', '', '160', '10', '320', '70', 'Бумажная', '');

-- --------------------------------------------------------

--
-- Структура таблицы `wallpaper_wallpaper`
--

CREATE TABLE IF NOT EXISTS `wallpaper_wallpaper` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `article` varchar(200) NOT NULL,
  `wallpaper` varchar(200) NOT NULL,
  `category` varchar(200) NOT NULL,
  `subcategory` varchar(200) NOT NULL,
  `interior` varchar(200) NOT NULL,
  `discount` int(3) NOT NULL,
  `number` int(10) NOT NULL DEFAULT '99',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=145 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `wallpaper_wallpaper`
--

INSERT INTO `wallpaper_wallpaper` (`id`, `article`, `wallpaper`, `category`, `subcategory`, `interior`, `discount`, `number`) VALUES
(109, '718701574.jpg', 'Цветы', '3 D Арт', 'Цветы', 'interior-image_3.png', 0, 1),
(112, '1053224498.jpg', '', '3 D Арт', 'Цветы', 'interior-image_3.png', 0, 2),
(113, '1211237194.jpg', '', '3 D Арт', 'Цветы', 'interior-image_3.png', 0, 3),
(114, '1220071765.jpg', '', '3 D Арт', 'Цветы', 'interior-image_3.png', 0, 4),
(115, '1289960146.jpg', '', '3 D Арт', 'Цветы', 'interior-image_3.png', 0, 5),
(116, '1497240944.jpg', '', '3 D Арт', 'Цветы', 'interior-image_3.png', 0, 6),
(117, '1503138668.jpg', '', '3 D Арт', 'Цветы', 'interior-image_3.png', 0, 7),
(118, '1753616627.jpg', '', '3 D Арт', 'Цветы', 'interior-image_3.png', 0, 8),
(120, '1398210953.jpg', '', '3 D Арт', 'Цветы', 'interior-image_3.png', 0, 17),
(121, '1423088177.jpg', '', '3 D Арт', 'Цветы', 'interior-image_3.png', 0, 18),
(123, '1426386911.jpg', '', '3 D Арт', 'Цветы', 'interior-image_3.png', 0, 21),
(127, '1657144138.jpg', '', '3 D Арт', 'Цветы', 'interior-image_3.png', 0, 0),
(128, '1839984556.jpg', '', '3 D Арт', 'Цветы', 'interior-image_3.png', 0, 0),
(130, '602160497.jpg', '', '3 D Арт', 'Мрамор', 'interior-image_3.png', 0, 0),
(131, '783201298.jpg', '', '3 D Арт', 'Мрамор', 'interior-image_3.png', 0, 0),
(132, '1092609575.jpg', '', '3 D Арт', 'Мрамор', 'interior-image_3.png', 0, 0),
(133, '1433532953.jpg', '', '3 D Арт', 'Цветы', 'interior-image_3.png', 0, 0),
(134, '1333741913.jpg', '', '3 D Арт', '3 D', 'interior-image_3.png', 0, 0),
(135, '1394528477.jpg', '', '3 D Арт', 'Цветы', 'interior-image_3.png', 0, 0),
(137, '1366197701.jpg', '', '3 D Арт', 'Цветы', 'interior-image_3.png', 0, 0),
(138, '1396459472.jpg', '', '3 D Арт', '3 D', 'interior-image_3.png', 0, 0),
(141, '123456789.jpg', 'test', '3 D Арт', 'Мрамор', 'interior-image_3.png', 0, 0),
(142, '1496262356.jpg', '', '3 D Арт', '3 D', 'interior-image_3.png', 0, 0),
(143, '1392043274.jpg', '', '3 D Арт', '3 D', 'interior-image_2.png', 5, 1),
(144, '1380225119.jpg', '', '3 D Арт', '3 D', 'interior-image_3.png', 0, 0);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
